{
  "menu": {
    "home": "Home",
    "about": "About me",
    "resume": "Resume",
    "projects": "Projects",
    "certificates": "Certificates",
    "contact": "Contact"
  },
  "intro": {
    "title": "I'm David Pessoa",
    "job1": "Software Developer",
    "job2": "Computer Scientist",
    "button": "More about me"
  },
  "about": {
    "subTitle": "About me",
    "title": "Let me introduce myself",
    "description": "Hello! I'm David Pessoa, Software Developer, Computer Science graduate from Mackenzie Presbyterian University and Electronics Technician from Liceu de Artes e Ofícios de São Paulo.",
    "aspirations": "I aim to work as a Software Engineer, improving my skills in web, software and mobile applications, while gaining experience in software architecture, project management."
  },
  "resume": {
    "subTitleResume": "Resume",
    "title": "My Experiences",
    "subTitleProfXP": "Professional Experience",
    "20DASH": {
      "roleName": "Full Stack Developer",
      "period": "Sep 2025 - Dec 2025",
      "company": "20DASH",
      "description": "At the end of 2025, I worked as a Full Stack Developer intern at 20DASH. On the back end, I collaborated on the development of microservices-based systems using AWS Lambda (serverless) with the Chalice Framework, integrated with a PostgreSQL database hosted on AWS RDS. On the front end, I contributed to interface development using React.js with Vite.js, focusing on reusable components, best practices in state management, and seamless API integration."
    },
    "elevential": {
      "roleName": "Back-end Developer",
      "period": "Nov 2024 - Jan 2025",
      "company": "Elevential",
      "description": "During my internship at Elevential, I worked as a Python programmer contributing to a project with Django framework and integrated with a PostgreSQL database for database management. Additionally, I contributed to front-end development using Javascript and the Bootstrap framework"
    },
    "mackleaps": {
      "roleName": "Front-end Developer",
      "period": "March 2023 - Nov 2023",
      "company": "Mackleaps",
      "description": "In 2023, I worked as a volunteer at Mackleaps Junior Company to develop the front-end (using HTML, CSS, Javascript and React.js) of a web application to display weather data from stations located on the Mackenzie campus. <a href='https://mackleaps.mackenzie.br/grafana/public-dashboards/4d1d71b3511f4151b6c042dbbbef965b?orgId=1&from=now-7d&to=now&timezone=browser' target='_blank'>Click here</a> to see the website."
    },
    "subTitleAcademicXP": "Academic Education",
    "computerScience": {
      "courseName": "Computer Science",
      "period": "Feb 2022 - Nov 2025",
      "institution": "Universidade Presbiteriana Mackenzie",
      "degree": "Bachelor's Degree in Computer Science",
      "TCC": "Performance evaluation of LLM-based with RAG application for answering Environmental Law questions (Bachelor’s Thesis)",
      "monitor": "Teaching Assistant – Algorithms and Programming II",
      "research": "A study on the interaction of the elderly with digital games through usability and user experience evaluations, published on Centro Latino Americano de Estudios en Informática (CLEI). DOI: <a href='https://doi.org/10.19153/cleiej.27.1.4' target='_blank'>https://doi.org/10.19153/cleiej.27.1.4</a>",
      "concierge": "Concierge Project"
    },
    "electronics": {
      "courseName": "Electronics",
      "period": "Jan 2018 - Nov 2020",
      "institution": "Liceu de Artes e Ofícios de São Paulo",
      "degree": "Electronics Technical course integrated to high school",
      "TCC": "Automated Parking Lot (Capstone Project)"
    },
    "subTitleSkills": "Skills",
    "softSkills": {
      "communication": {
        "title": "Communication",
        "description": "Communicating clearly and concisely with team members and steakholders"
      },
      "english": {
        "title": "English Fluency",
        "description": "Ability to communicate effectively in both written and spoken contexts"
      },
      "teamwork": {
        "title": "Teamwork",
        "description": "Collborating harmoniously with others to achieve project goals"
      },
      "organization": {
        "title": "Organization",
        "description": "Ability to organize tasks and manage time efficiently"
      }
    },
    "downloadBtn": "<a href='CV-file/Resume_David_Pessoa.pdf' target='_blank' title='Download CV' class='button button-primary'>Download CV</a>"
  }, 
  "portfolio": {
    "subTitle": "Portfolio",
    "title": "My Projects",
    "dentalClinic": {
      "title": "Dental Clinic Website",
      "description": "I developed a website using Next.js as part of a Web and Mobile Development course project. The application includes a homepage presenting the clinic’s services, patient reviews, and profiles of dental professionals. The entire website was built with a strong focus on responsiveness, ensuring a good user experience across different screen sizes and devices. <a href='https://clinicaodontologica.davidpessoa.com.br/' target='_blank'>Click here to check out the web site!</a>"
    },
    "samsai": {
      "title": "SamsAI",
      "description": "As my undergraduate capstone project, I developed, together with my colleagues, an application using Django and integrated with Maritaca AI’s Sabiá-3 artificial intelligence model to support the Judiciary. The application is also integrated with a Retrieval Augmented Generation (RAG) system to provide legal context to the model, enabling it to answer users’ questions. The project aims to provide lawyers and judges with a tool to help them handle the large volume of ongoing cases and reduce delays in case resolution, thereby streamlining judicial processes"
    },
    "weatherStation": {
      "title": "Weather Station",
      "description": "In order to develop my skills with the Django framework in Python (as well as some front-end skills), I decided to create this application, which retrieves data from the weather station of a selected city and displays it on the screen. The data is obtained from <a href='https://www.weatherapi.com/ target='_blank'>WeatherAPI</a>." 
    },
    "bank": {
      "title": "Bank of Django",
      "description": "Like the Weather Station project, this is another personal project aimed at improving my skills with the Django framework and front-end development. In this application, users can create an account and log in to perform withdrawals, deposits, and even PIX transfers, which can be viewed in the transaction history."
    },
    "concierge": {
      "title": "The Concierge",
      "description": "During the first semester of the Computer Science program at Mackenzie (2022), I developed a remote-controlled cart operated via a mobile application. Its purpose was to carry objects for the user, reducing physical effort. I named it Concierge, inspired by the hotel staff responsible for carrying guests’ luggage. On its top, the cart features a scale to monitor the carried weight, which is displayed on a front-facing screen. The Concierge also indicates when the weight exceeds the allowed limit."
    },
    "parkingLot": {
      "title": "Automated Parking Lot",
      "description": "In the final year of the Electronics program at Liceu (2020), I built a scale model of an automated parking system as my capstone project. The model consisted of a parking lot in which light sensors installed in each parking space detected the presence of a vehicle through changes in light intensity. This allowed each space to be indicated as available (green LED) or occupied (red LED). In addition, the project included radio-frequency sensors to detect the tags used by elderly users, helping to prevent designated parking spaces from being improperly occupied. Watch the video."
    }
  },
  "certificates": {
    "subTitle": "Certificates",
    "title": "My Certificates",
    "carousel": {
      "django": "Certificate of Completion - Python Programming with Django",
      "efset": "EF SET English Proficiency Certificate - C1",
      "IABrasil": "AI for EVERYONE Course Certificate",
      "mackleaps": "Certificate of Completion - Software Residence at Mackleaps",
      "santander": "Certificate of Completion - Santander X Explorer",
      "monitoria": "Teaching Assistant on Algorithms and Programming II Certificate"
    }
  },
  "contact": {
    "subTitle": "Contact",
    "title": "Feel free to contact me!",
    "details": {
      "whatsapp": {
        "title": "WhatsApp",
        "info": "Cellphone: +55 (11) 94748 0925"
      },
      "github": {
        "title": "GitHub",
        "info": "User: david-pessoa"
      }
    }
  }
}
